mypass/src/Catalogs/ГруппыДанных/ГруппыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДанных</name>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
  </predefined>
  <attributes>
    <name>Цвет</name>
    <comment>Используется в рабочем месте &quot;Мои доступы и пароли&quot; в стиле &quot;Современный&quot;</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mypass/src/Documents/ЭкземплярДоступа/ЭкземплярДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭкземплярДоступа</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.МоиПароли</registerRecords>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>CatalogRef.ВидыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДанных</name>
    <type>
      <types>EnumRef.СтатусыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДанных</name>
    <type>
      <types>CatalogRef.ГруппыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассДанных</name>
    <type>
      <types>EnumRef.КлассыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрисоединенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

mypass/src/Catalogs/ГруппыДанных/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Производит инициализацию элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыДанных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДанных КАК ГруппыДанных
	|ГДЕ
	|	ГруппыДанных.ИмяПредопределенныхДанных = ""ОБЩИЕ""";
	
	// Проверим существование предопределенного элемента
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 5
	|	ГруппыДанных.Ссылка КАК Ссылка,
	|	ГруппыДанных.Наименование КАК Наименование,
	|	ЭкземплярыДоступа.Количество КАК Количество
	|ИЗ
	|	Справочник.ГруппыДанных КАК ГруппыДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЭкземплярДоступа.ГруппаДанных КАК ГруппаДанных,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			Документ.ЭкземплярДоступа КАК ЭкземплярДоступа
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЭкземплярДоступа.ГруппаДанных) КАК ЭкземплярыДоступа
	|		ПО ГруппыДанных.Ссылка = ЭкземплярыДоступа.ГруппаДанных
	|ГДЕ
	|	НЕ ГруппыДанных.ПометкаУдаления
	|	И (ГруппыДанных.Наименование ПОДОБНО ""основн%""
	|			ИЛИ ГруппыДанных.Наименование ПОДОБНО ""общ%"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=0 Тогда
		Объект = Справочники.ГруппыДанных.СоздатьЭлемент();
		Объект.Наименование = НСтр("ru = 'Общие'");
		Объект.Комментарий  = НСтр("ru = 'Создан при начальном заполнении'");
		Объект.УстановитьНовыйКод();
	Иначе
		Выборка.Следующий();
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ПометкаУдаления = ЛОЖЬ;
	КонецЕсли;
	Объект.ИмяПредопределенныхДанных = "Общие";
	Объект.Записать();
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить уникальные реквизиты.
// 
// Параметры:
//  Объект - СправочникОбъект.ВидыДанных
// 
// Возвращаемое значение:
//  Структура -  Получить уникальные реквизиты:
// * Наименование - Произвольный
//@skip-check constructor-function-return-section
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура;
	УникальныеРеквизиты.Вставить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

#КонецОбласти

#КонецЕсли
